{
  "News": {
    "title": "أحدث الأخبار والإعلانات",
    "see all": "عرض الكل",
    "highlighted": {
      "tag": "شراكة",
      "date": "01 أبريل 2024",
      "duration": "5 دقائق قراءة",
      "headline": "شركة أي سي آي وأف أس تدفعان تحديث الدفعات للبنوك والتجار في الشرق الأوسط",
      "content": "ستستخدم أف أس، الرائدة في تقديم حلول الدفع الرقمية وممكّن التكنولوجيا المالية في الشرق الأوسط وأفريقيا، منصة أي سي آي للدفعات المؤسسية ومنصة أي سي آي لتنسيق الدفعات لتعزيز تحديث الدفعات الرقمية في المنطقة"
    },
    "news": [
      {
        "tag": "دراسات الحالة",
        "date": "05 مارس 2024",
        "duration": "5 دقائق قراءة",
        "headline": "مؤشر عمليات أف أس: سباق البحرين جائزة الاتحاد الجديد يسجل زيادة بنسبة 66% في الإنفاق",
        "content": "شهدت جائزة الاتحاد الجديد للبحرين هذا العطلة الأسبوعية زيادة ملحوظة في الإنفاق. وقد قارنت البيانات المشتركة في المؤشر السنوي للعمليات الذي نشرته خدمات أف أس العربية للدفع الرقمي، وهي الشركة الرائدة في منطقة الشرق الأوسط وأفريقيا في تقديم حلول الدفع الرقمية وممكّن التكنولوجيا المالية، الفرق في الإنفاق خلال أسبوع سباق الفورمولا 1، حيث سجلت زيادة بنسبة 66% في إنفاق الدفعات خلال جائزة البحرين الكبرى للطيران لعام 2024 التي انتهت مؤخراً."
      },
      {
        "tag": "شراكة",
        "date": "05 مارس 2024",
        "duration": "5 دقائق قراءة",
        "headline": "أف أس تبرم تحالفًا استراتيجيًا مع إكسبنس للابتكار في إدارة الأعمال الصغيرة والمتوسطة في البحرين",
        "content": "في خطوة مهمة وضعت لإعادة تعريف إدارة الأعمال المالية للشركات الصغيرة والمتوسطة (الشركات الصغيرة والمتوسطة) في البحرين، دخلت أف أس، الشركة الرائدة في منطقة الشرق الأوسط وأفريقيا في تقديم حلول الدفع الرقمية وممكّن التكنولوجيا المالية، شراكة استراتيجية مع إكسبنس"
      },
      {
        "tag": "شراكة",
        "date": "05 مارس 2024",
        "duration": "5 دقائق قراءة",
        "headline": "أف أس تقيم ورشة عمل إعلامية لعرض أحدث حلول المطاعم على أساس السحابة",
        "content": "أف أس، الشركة الرائدة في منطقة الشرق الأوسط وأفريقيا في..."
      }
    ]
  }
}
